000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КлассификаторБанков/КлассификаторБанков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторБанков</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Город</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДеятельностьПрекращена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Интеграция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПоЕДРПОУ</name>
    <comment>Код по ЕДРПОУ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоррСчет</name>
    <comment>Корреспондентский счет банка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>34</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаМинимальногоКредита</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Телефоны</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИнтернетБанкинга</name>
    <comment>Предоставление услуги с помощью API банка</comment>
    <type>
      <types>EnumRef.ТипыИнтернетБанкинга</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеИнкассатора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидУпаковкиПриИнкассации</name>
    <type>
      <types>EnumRef.ВидУпаковкиПриИнкассации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолучательИнкассации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АдресацияAPI</name>
    <attributes>
      <name>Адрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Активен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Идентификатор</name>
      <comment>ID нашей организации в банке</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <comment>Секретный ключ доступа</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипУслуги</name>
      <type>
        <types>EnumRef.ТипыУслугБанка</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/Catalogs/КлассификаторБанков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПередЗаписью(Отказ)	//	LNK 07.10.2020 13:04:42

	Если ОбменДанными.Загрузка Тогда

		Если НЕ ЭтоНовый() И ОбменДаннымиПовтИсп.ЭтоТестовыйУзел() Тогда

			Запрос = Новый Запрос(
			"ВЫБРАТЬ
			|	ТаблицаСправочник.Интеграция КАК Интеграция,
			|	ТаблицаСправочник.ТипИнтернетБанкинга КАК ТипИнтернетБанкинга,
			|	ТаблицаСправочник.СуммаМинимальногоКредита КАК СуммаМинимальногоКредита,
			|	ТаблицаСправочник.АдресацияAPI.(
			|		НомерСтроки КАК НомерСтроки,
			|		Адрес КАК Адрес,
			|		Активен КАК Активен,
			|		Идентификатор КАК Идентификатор,
			|		Ключ КАК Ключ,
			|		Комментарий КАК Комментарий,
			|		ТипУслуги КАК ТипУслуги
			|	) КАК АдресацияAPI
			|ИЗ
			|	Справочник.КлассификаторБанков КАК ТаблицаСправочник
			|ГДЕ
			|	ТаблицаСправочник.Ссылка = &ТекущаяСсылка"
			);
			Запрос.УстановитьПараметр("ТекущаяСсылка", Ссылка);
			
			ДанныеСсылки = Запрос.Выполнить().Выбрать();
			
			Если ДанныеСсылки.Следующий() Тогда

				Интеграция = ДанныеСсылки.Интеграция;
				ТипИнтернетБанкинга = ДанныеСсылки.ТипИнтернетБанкинга;
				СуммаМинимальногоКредита = ДанныеСсылки.СуммаМинимальногоКредита;

				АдресацияAPI.Загрузить(ДанныеСсылки.АдресацияAPI.Выгрузить());

			КонецЕсли;

		КонецЕсли;

		Возврат;

	КонецЕсли;

//	=======================================================================================


КонецПроцедуры

#КонецЕсли
